In [1]:
import pandas as pd
import os

In [2]:
file_to_load = os.path.join("Resources","missing_grades.csv")

In [4]:
missing_data_df= pd.read_csv(file_to_load)
missing_data_df

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0         NaN
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [6]:
missing_data_df.count()

Student ID       8
student_name     8
gender           8
grade            8
reading_score    7
math_score       7
dtype: int64

In [7]:
missing_data_df.notnull().sum()

Student ID       8
student_name     8
gender           8
grade            8
reading_score    7
math_score       7
dtype: int64

In [8]:
missing_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
reading_score    1
math_score       1
dtype: int64

In [9]:
# Fill in the empty rows with "85".
missing_data_df.fillna(85)

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th           85.0        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0        85.0
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [10]:
missing_data_df.describe()

       Student ID  reading_score  math_score
count     8.00000       7.000000    7.000000
mean      3.50000      85.142857   70.142857
std       2.44949      13.667828   10.823255
min       0.00000      66.000000   58.000000
25%       1.75000      74.500000   60.500000
50%       3.50000      94.000000   69.000000
75%       5.25000      95.000000   79.500000
max       7.00000      97.000000   84.000000

In [11]:
missing_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     8 non-null      int64
 1   student_name   8 non-null      object
 2   gender         8 non-null      object
 3   grade          8 non-null      object
 4   reading_score  7 non-null      float64
 5   math_score     7 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 512.0+ bytes

In [12]:
missing_data_df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'